In [1]:
s = "python"

In [2]:
list(s)

['p', 'y', 't', 'h', 'o', 'n']

In [3]:
s[:3]

'pyt'

In [4]:
s = "12\\34"

In [5]:
print(s)

12\34

In [15]:
temps_f = [66,70,66,64,64,59,52]

In [7]:
# code to convert temp_f to celcius

temps_c = []
for temp in temps_f:
    celcius = (temp -32)/1.8
    temps_c.append(celcius)

In [8]:
temps_c

[18.88888888888889,
 21.11111111111111,
 18.88888888888889,
 17.77777777777778,
 15.0,
 11.11111111111111]

In [9]:
# import pandas library
import pandas as pd

In [16]:
# transform list temps_f into a pandas series named temp_series_f
temp_series_f = pd.Series(temps_f)

In [17]:
temp_series_f

0    66
1    70
2    66
3    64
4    64
5    59
6    52
dtype: int64

In [ ]:
# convert the frahenheight values in temp_series_f to celcius saved in a variable named temp series c

In [18]:
temp_series_c = (temp_series_f- 32)/1.8

In [19]:
temp_series_c

0    18.888889
1    21.111111
2    18.888889
3    17.777778
4    17.777778
5    15.000000
6    11.111111
dtype: float64

In [27]:
days_list =["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"]

In [22]:
df = pd.DataFrame()

In [28]:
# add column days
df['days'] = days_list

In [24]:
#add column temps_f
df['temps_f'] = temps_f

In [29]:
df

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64
5   Saturday       59
6     Sunday       52

In [31]:
## combine our two lists into a python dictionary then create a DataFrame from the dictionary
temp_dict = {'Days':days_list,'Temps_F':temps_f}
temp_dict

{'Days': ['Monday',
  'Tuesday',
  'Wednesday',
  'Thursday',
  'Friday',
  'Saturday',
  'Sunday'],
 'Temps_F': [66, 70, 66, 64, 64, 59, 52]}

In [33]:
df_fromDict = pd.DataFrame(temp_dict)
df_fromDict

        Days  Temps_F
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64
5   Saturday       59
6     Sunday       52

In [34]:
len(df)

7

In [35]:
df.head()

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64

In [36]:
df.tail()

        days  temps_f
2  Wednesday       66
3   Thursday       64
4     Friday       64
5   Saturday       59
6     Sunday       52

In [40]:
df.sample(4)

       days  temps_f
1   Tuesday       70
0    Monday       66
5  Saturday       59
3  Thursday       64

In [41]:
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['days', 'temps_f'], dtype='object')]

In [42]:
df.dtypes

days       object
temps_f     int64
dtype: object

In [43]:
df.shape

(7, 2)

In [45]:
df.info

<bound method DataFrame.info of         days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64
5   Saturday       59
6     Sunday       52>

In [46]:
df.columns

Index(['days', 'temps_f'], dtype='object')

In [56]:
df['temps_f'].unique

<bound method Series.unique of 0    66
1    70
2    66
3    64
4    64
5    59
6    52
Name: temps_f, dtype: int64>

In [58]:
df["temps_f"].describe()

count     7.000000
mean     63.000000
std       5.859465
min      52.000000
25%      61.500000
50%      64.000000
75%      66.000000
max      70.000000
Name: temps_f, dtype: float64

In [64]:
## Extract specific rows by index
df.iloc[5]

days       Saturday
temps_f          59
Name: 5, dtype: object

In [65]:
df.iloc[0]

days       Monday
temps_f        66
Name: 0, dtype: object

In [66]:
df.loc[0]

days       Monday
temps_f        66
Name: 0, dtype: object

In [67]:
df.iloc[0:3]

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66

In [69]:
df_ss = df.iloc[0:4]
df_ss

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64

In [72]:
df.days == "Tuesday"

0    False
1     True
2    False
3    False
4    False
5    False
6    False
Name: days, dtype: bool

In [73]:
df["days"]== "Tuesday"

0    False
1     True
2    False
3    False
4    False
5    False
6    False
Name: days, dtype: bool

In [79]:
(df.days == "Tuesday")|(df.days == "Wednesday")

0    False
1     True
2     True
3    False
4    False
5    False
6    False
Name: days, dtype: bool

In [80]:
df[(df.days == "Tuesday")|(df.days == "Wednesday")]

        days  temps_f
1    Tuesday       70
2  Wednesday       66

In [81]:
df[df.temps_f >60]

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64

In [88]:
df[(df.days == "Saturday")| (df.days == "Sunday") &(df.temps_f > 55)]

       days  temps_f
5  Saturday       59

In [89]:
df[df["temps_f"]> 60]

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64

In [90]:
df[(df['days'] == "Saturday")| (df["days"] == "Sunday") & (df["temps_f"] > 55)]

       days  temps_f
5  Saturday       59

In [93]:
#create new data frame
df_dayindexed = df.set_index("days")
df_dayindexed

           temps_f
days
Monday          66
Tuesday         70
Wednesday       66
Thursday        64
Friday          64
Saturday        59
Sunday          52

In [94]:
df_dayindexed.shape

(7, 1)

In [95]:
df_dayindexed.columns

Index(['temps_f'], dtype='object')

In [96]:
df_dayindexed.loc["Tuesday"]

temps_f    70
Name: Tuesday, dtype: int64

In [99]:
df_dayindexed.iloc[0]

temps_f    66
Name: Monday, dtype: int64

In [ ]:
## Adding and Renaming Columns

In [106]:
low_temps = [41,43,45,43,54,43,37]
low_temps

[41, 43, 45, 43, 54, 43, 37]

In [102]:
df

        days  temps_f
0     Monday       66
1    Tuesday       70
2  Wednesday       66
3   Thursday       64
4     Friday       64
5   Saturday       59
6     Sunday       52

In [120]:
## add new column from the low_temp_list
df["low_temps"] = low_temps
df

        days  temps_f  low_temps
0     Monday       66         41
1    Tuesday       70         43
2  Wednesday       66         45
3   Thursday       64         43
4     Friday       64         54
5   Saturday       59         43
6     Sunday       52         37

In [123]:
df.rename(columns={"temps_f":"high_temps"}, inplace = True)
df

        days  high_temps  low_temps
0     Monday          66         41
1    Tuesday          70         43
2  Wednesday          66         45
3   Thursday          64         43
4     Friday          64         54
5   Saturday          59         43
6     Sunday          52         37

In [124]:
df.columns

Index(['days', 'high_temps', 'low_temps'], dtype='object')

In [125]:
df.columns = ["Days","High_Temps","Low_Temps"]

In [126]:
df

        Days  High_Temps  Low_Temps
0     Monday          66         41
1    Tuesday          70         43
2  Wednesday          66         45
3   Thursday          64         43
4     Friday          64         54
5   Saturday          59         43
6     Sunday          52         37

In [175]:
penguins = pd.read_csv(r"C:\Users\KAsab\Downloads\palmerpenguins.csv")

In [177]:
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
...,...,...,...,...,...,...,...,...
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
342,Chinstrap,Dream,50.8,19.0,210.0,4100.0,male,2009
343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,female,2009

In [136]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [137]:
penguins.shape

(344, 8)

In [141]:
penguins.dtypes

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

In [142]:
penguins["bill_length_mm"].describe()

count    342.000000
mean      43.921930
std        5.459584
min       32.100000
25%       39.225000
50%       44.450000
75%       48.500000
max       59.600000
Name: bill_length_mm, dtype: float64

In [143]:
penguins.describe()

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,342.000000,342.000000,342.000000,342.000000,344.000000
mean,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,5.459584,1.974793,14.061714,801.954536,0.818356
min,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,59.600000,21.500000,231.000000,6300.000000,2009.000000

In [144]:
penguins["bill_depth_mm"].max()

21.5

In [147]:
penguins["species"].unique()

array(['Adelie', 'Gentoo', 'Chinstrap'], dtype=object)

In [148]:
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
...,...,...,...,...,...,...,...,...
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
342,Chinstrap,Dream,50.8,19.0,210.0,4100.0,male,2009
343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,female,2009

In [149]:
## check for missing values
penguins.isna()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,True,True,True,True,True,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
339,False,False,False,False,False,False,False,False
340,False,False,False,False,False,False,False,False
341,False,False,False,False,False,False,False,False
342,False,False,False,False,False,False,False,False
343,False,False,False,False,False,False,False,False

In [150]:
penguins["flipper_length_mm"].isna()

0      False
1      False
2      False
3       True
4      False
       ...
339    False
340    False
341    False
342    False
343    False
Name: flipper_length_mm, Length: 344, dtype: bool

In [152]:
penguins["species"].isna().unique()

array([False])

In [153]:
penguins["bill_length_mm"].isna().unique()

array([False,  True])

In [178]:
## remove all rows that have at least one missing value
penguins.dropna(axis = 0, inplace = True)

In [157]:
penguins.shape

(333, 8)

In [158]:
penguins["bill_length_mm"].isna().unique()

array([False])

In [ ]:
## Sorting data

In [162]:
 ## sort penguins by bill length from smallest to largest
penguins.sort_values( by = "bill_length_mm")

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
142,Adelie,Dream,32.1,15.5,188.0,3050.0,female,2009
98,Adelie,Dream,33.1,16.1,178.0,2900.0,female,2008
70,Adelie,Torgersen,33.5,19.0,190.0,3600.0,female,2008
92,Adelie,Dream,34.0,17.1,185.0,3400.0,female,2008
18,Adelie,Torgersen,34.4,18.4,184.0,3325.0,female,2007
...,...,...,...,...,...,...,...,...
267,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
253,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,male,2009
293,Chinstrap,Dream,58.0,17.8,181.0,3700.0,female,2007
185,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,male,2007

In [ ]:
## sort in descending order

In [163]:
penguins.sort_values( by = "bill_length_mm",ascending = False)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
185,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,male,2007
293,Chinstrap,Dream,58.0,17.8,181.0,3700.0,female,2007
253,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,male,2009
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
267,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
...,...,...,...,...,...,...,...,...
18,Adelie,Torgersen,34.4,18.4,184.0,3325.0,female,2007
92,Adelie,Dream,34.0,17.1,185.0,3400.0,female,2008
70,Adelie,Torgersen,33.5,19.0,190.0,3600.0,female,2008
98,Adelie,Dream,33.1,16.1,178.0,2900.0,female,2008
142,Adelie,Dream,32.1,15.5,188.0,3050.0,female,2009

In [ ]:
## sort by year,then by bill length

In [164]:
penguins.sort_values(["year","bill_length_mm"])

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
18,Adelie,Torgersen,34.4,18.4,184.0,3325.0,female,2007
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,male,2007
25,Adelie,Biscoe,35.3,18.9,187.0,3800.0,female,2007
22,Adelie,Biscoe,35.9,19.2,189.0,3800.0,female,2007
42,Adelie,Dream,36.0,18.5,186.0,3100.0,female,2007
...,...,...,...,...,...,...,...,...
233,Gentoo,Biscoe,52.5,15.6,221.0,5450.0,male,2009
259,Gentoo,Biscoe,53.4,15.8,219.0,5500.0,male,2009
267,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
253,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,male,2009

In [ ]:
## Basic Calculations

In [ ]:
## find mean of each numeric variables

In [170]:
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007
...,...,...,...,...,...,...,...,...
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
342,Chinstrap,Dream,50.8,19.0,210.0,4100.0,male,2009
343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,female,2009

In [184]:
penguins_num.mean()

bill_length_mm         43.992793
bill_depth_mm          17.164865
flipper_length_mm     200.966967
body_mass_g          4207.057057
year                 2008.042042
dtype: float64

In [181]:
penguins_num = penguins.select_dtypes( include = ["number"])

In [182]:
penguins_num.mean()

bill_length_mm         43.992793
bill_depth_mm          17.164865
flipper_length_mm     200.966967
body_mass_g          4207.057057
year                 2008.042042
dtype: float64

In [183]:
penguins_num.corr()

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
bill_length_mm,1.000000,-0.228626,0.653096,0.589451,0.032657
bill_depth_mm,-0.228626,1.000000,-0.577792,-0.472016,-0.048182
flipper_length_mm,0.653096,-0.577792,1.000000,0.872979,0.151068
body_mass_g,0.589451,-0.472016,0.872979,1.000000,0.021862
year,0.032657,-0.048182,0.151068,0.021862,1.000000

In [ ]:
penguins.select_dtypes(include = ["ob"])